Repository: juanse07/nexa
Catalog: lib/l10n/app_*.arb
Languages: es

# discoverVenuesWarning
source: AI will search the web for event venues in {cityName}. This can take up to 2-3 minutes depending on the city size. Please keep the app open during the search.
es: La IA buscará lugares de eventos en la web en {cityName}. Esto puede tomar de 2 a 3 minutos según el tamaño de la ciudad. Mantén la aplicación abierta durante la búsqueda.

source: Start Search
es: Iniciar Búsqueda

# discoveredVenuesCount
source: Discovered {count} venues for {cityName}
es: Descubiertos {count} lugares para {cityName}

source: Failed to discover venues
es: Error al descubrir lugares

source: No cities added yet
es: Sin ciudades agregadas aún

# addFirstCityDiscover
source: Add your first city to discover venues
es: Agrega tu primera ciudad para descubrir lugares

source: Tourist City (strict search)
es: Ciudad Turística (búsqueda estricta)

source: Metro Area (broad search)
es: Área Metropolitana (búsqueda amplia)

# searchingWeb
source: Searching web... (up to 3 min)
es: Buscando en la web... (hasta 3 min)

source: Add City
es: Agregar Ciudad

source: Select or Type City
es: Selecciona o Escribe Ciudad

source: Country
es: País

source: All Countries
es: Todos los Países

source: State/Province
es: Estado/Provincia

source: All States
es: Todos los Estados

source: Type or Search City
es: Escribe o Busca Ciudad

source: Enter any city name...
es: Ingresa cualquier nombre de ciudad...

source: Use custom city:
es: Usar ciudad personalizada:

# noMatchingCitiesSuggestions
source: No matching cities in suggestions
es: Sin ciudades coincidentes en sugerencias

# canTypeAnyCityAbove
source: You can type any city name above
es: Puedes escribir cualquier nombre de ciudad arriba

source: Tourist
es: Turística

source: suggested cities
es: ciudades sugeridas

source: Add Your First City
es: Agregar Tu Primera Ciudad

source: Add Another City
es: Agregar Otra Ciudad

# logoUploadedColorsExtracted
source: Logo uploaded and colors extracted!
es: ¡Logo cargado y colores extraídos!

source: Failed to upload logo
es: Error al cargar el logo

# removeBrandingConfirmation
source: Remove Branding?
es: ¿Eliminar Marca?

# removeBrandingWarning
source: This will delete your logo and custom colors. Exported documents will revert to the default FlowShift styling.
es: Esto eliminará tu logo y colores personalizados. Los documentos exportados volverán al estilo FlowShift predeterminado.

source: Brand Customization
es: Personalización de Marca

# upgradeToProCustomization
source: Upgrade to Pro to personalize your exported documents with your own logo and brand colors.
es: Actualiza a Pro para personalizar tus documentos exportados con tu propio logo y colores de marca.

source: Upload Your Logo
es: Sube Tu Logo

# logoFormats
source: JPEG, PNG, or WebP (max 5MB)
es: JPEG, PNG o WebP (máx. 5MB)

source: Replace Logo
es: Reemplazar Logo

source: Document Style
es: Estilo de Documento

# chooseDocumentStyle
source: Choose how exported documents look
es: Elige cómo se ven los documentos exportados

# extractingColors
source: Extracting brand colors with AI...
es: Extrayendo colores de marca con IA...

source: Uploading logo...
es: Cargando logo...

source: Branding removed
es: Marca eliminada

source: Colors saved!
es: ¡Colores guardados!

source: Save Colors
es: Guardar Colores

source: AI Extracted
es: Extraído por IA

source: Hex Color
es: Color Hexadecimal

source: Merge Duplicate Clients
es: Fusionar Clientes Duplicados

source: Merging clients...
es: Fusionando clientes...

source: Confirm Merge
es: Confirmar Fusión

# keepPrimary
source: Keep: "{name}"
es: Mantener: "{name}"

# mergeDuplicatesCount
source: Merge & delete {count} duplicate(s):
es: Fusionar y eliminar {count} duplicado(s):

# transferEventsAndTariffs
source: All events and tariffs will be transferred to "{name}".
es: Todos los eventos y tarifas se transferirán a "{name}".

source: Merge
es: Fusionar

source: Failed to merge
es: Error al fusionar

# mergedClients
source: Merged {count} client(s) into "{name}"
es: {count} cliente(s) fusionados en "{name}"

# sensitivityLabel
source: Sensitivity: {percent}%
es: Sensibilidad: {percent}%

source: No duplicates found
es: No se encontraron duplicados

# lowerSensitivity
source: Try lowering the sensitivity to find looser matches.
es: Intenta bajar la sensibilidad para encontrar coincidencias más amplias.

source: Group {number}
es: Grupo {number}

# clientsCountLabel
source: {count} clients
es: {count} clientes

# tapClientSetPrimary
source: Tap a client to set it as primary (kept):
es: Toca un cliente para establecerlo como primario (mantenido):

source: will be merged
es: se fusionará

source: KEEP
es: MANTENER

# mergeInto
source: Merge {count} into "{name}"
es: Fusionar {count} en "{name}"

source: Profile Glow Up
es: Cambio de Imagen

source: Who are you today?
es: ¿Quién eres hoy?

# seeMore
source: See {count} more
es: Ver {count} más

# seeLess
source: Less
es: Menos

source: Pick your vibe
es: Elige tu vibra

source: Quality
es: Calidad

source: Standard
es: Estándar

# higherDetailFacialPreservation
source: Higher detail & better facial preservation
es: Mayor detalle y mejor preservación facial

source: Text in image
es: Texto en imagen

source: Optional
es: Opcional

source: None
es: Ninguno

# readyForNewLook
source: Ready for a new look?
es: ¿Listo para un nuevo aspecto?

# hitButtonSeeMagic
source: Hit the button and see the magic
es: Presiona el botón y ve la magia

source: Looking good!
es: ¡Se ve bien!

source: From your history
es: De tu historial

source: Before
es: Antes

source: After
es: Después

# usuallyTakes15Seconds
source: This usually takes about 15 seconds
es: Esto usualmente toma alrededor de 15 segundos

source: Failed to load styles
es: Error al cargar estilos

# aiGeneratedMayNotBeAccurate
source: AI-generated images may not be accurate
es: Las imágenes generadas por IA pueden no ser precisas

source: Try Again
es: Intentar de Nuevo

source: Generate New
es: Generar Nuevo

source: Get My New Look
es: Obtener Mi Nuevo Aspecto

# sendEventInvitationTooltip
source: Send Event Invitation
es: Enviar Invitación de Evento

source: Export Report
es: Exportar Reporte

source: Choose format and report type
es: Elige formato y tipo de reporte

source: Report Type
es: Tipo de Reporte

# payrollReportLabel
source: Payroll Report
es: Reporte de Nómina

# payrollReportDescription
source: Staff earnings breakdown by hours and pay rate
es: Desglose de ganancias del personal por horas y tarifa

# attendanceReportLabel
source: Attendance Report
es: Reporte de Asistencia

# attendanceReportDescription
source: Clock-in/out times and hours worked
es: Horarios de entrada/salida y horas trabajadas

source: Export Format
es: Formato de Exportación

source: Excel compatible
es: Compatible con Excel

source: Print ready
es: Listo para imprimir

# exportFormatButton
source: Export {format}
es: Exportar {format}

# lastSevenDays
source: Last 7 days
es: Últimos 7 días

source: This month
es: Este mes

source: This year
es: Este año

source: Custom range
es: Rango personalizado

# createInviteLinkTitle
source: Create Invite Link
es: Crear Enlace de Invitación

# shareableLinkDescription
source: Create a shareable link that anyone can use to join your team.
es: Crea un enlace compartible que cualquiera puede usar para unirse a tu equipo.

source: Link expires in:
es: El enlace expira en:

source: Max uses (optional):
es: Usos máximos (opcional):

# leaveEmptyUnlimited
source: Leave empty for unlimited
es: Dejar vacío para ilimitado

# requireApprovalTitle
source: Require approval
es: Requerir aprobación

# requireApprovalSubtitle
source: You must approve members after they join
es: Debes aprobar a los miembros después de que se unan

# passwordOptionalLabel
source: Password (optional):
es: Contraseña (opcional):

# leaveEmptyNoPassword
source: Leave empty for no password
es: Dejar vacío para sin contraseña

# createLinkButton
source: Create Link
es: Crear Enlace

# inviteLinkCreatedTitle
source: Invite Link Created!
es: Enlace de Invitación Creado!

# inviteCodeLabel
source: Invite Code:
es: Código de Invitación:

# deepLinkLabel
source: Deep Link:
es: Enlace Directo:

# shareDeepLinkHint
source: Share this link - it will open the app automatically
es: Comparte este enlace - abrirá la app automáticamente

source: Expires: {date}
es: Expira: {date}

# shareViaApps
source: Share via WhatsApp, SMS, etc.
es: Compartir por WhatsApp, SMS, etc.

source: Show QR Code
es: Mostrar Código QR

# joinTeamSubject
source: Join my team on FlowShift
es: Únete a mi equipo en FlowShift

source: Unknown applicant
es: Solicitante desconocido

source: Applied {date}
es: Solicitó {date}

source: Error loading events
es: Error al cargar eventos

# noEventsFoundTitle
source: No events found
es: No se encontraron eventos

# notLinkedToEventsYet
source: This user is not linked to any events yet
es: Este usuario aún no está vinculado a ningún evento

source: Upcoming Events ({count})
es: Próximos Eventos ({count})

# dateUnknownLabel
source: Date Unknown
es: Fecha Desconocida

# editEventTitle
source: Edit Event
es: Editar Evento

# eventUpdatedSuccessfully
source: Event has been updated successfully!
es: El evento se actualizó exitosamente!

source: Failed to update event
es: Error al actualizar evento

# selectDateHint
source: Select date
es: Seleccionar fecha

# dateLabel
source: Date
es: Fecha

# clockOutConfirmation
source: Are you sure you want to clock out {name}?
es: ¿Estás seguro de que quieres registrar la salida de {name}?

# removeStaffConfirmation
source: Are you sure you want to remove this staff member from the event?
es: ¿Estás seguro de que quieres eliminar a este miembro del personal del evento?

# openToAllStaffConfirmation
source: Make "{name}" visible to all staff members? This will change the job from private (invited only) to public, allowing all team members to see and accept it.
es: ¿Hacer "{name}" visible para todo el personal? Esto cambiará el trabajo de privado (solo invitados) a público, permitiendo que todos los miembros del equipo lo vean y acepten.

# clockInConfirmation
source: Clock in {name} for this event?
es: ¿Registrar entrada de {name} para este evento?

# workingHoursSheetTooltip
source: Working Hours Sheet
es: Hoja de Horas Trabajadas

# privateLabel
source: Private
es: Privado

# publicLabel
source: Public
es: Público

# privatePlusPublic
source: Private+Public
es: Privado+Público

# setUpStaffingCompany
source: Set up your staffing company (e.g., "MES - Minneapolis Event Staffing")
es: Configura tu empresa de personal (ej., "MES - Minneapolis Event Staffing")

# descriptionOptionalLabel
source: Description (optional)
es: Descripción (opcional)

# briefDescriptionHint
source: Brief description of your staffing company
es: Breve descripción de tu empresa de personal

# createTeamButton
source: Create team
es: Crear equipo

source: Clients configured: {count}
es: Clientes configurados: {count}

# needAtLeastOneClientDesc
source: You need at least one client before you can staff events.
es: Necesitas al menos un cliente antes de poder programar eventos.

# clientNameLabel
source: Client name
es: Nombre del cliente

# completeProfileAndTeam
source: Complete profile and team first
es: Completa perfil y equipo primero

# createClientButton
source: Create client
es: Crear cliente

source: Roles configured: {count}
es: Roles configurados: {count}

# rolesHelpMatchStaffDesc
source: Roles help match staff to the right job (waiter, chef, bartender...).
es: Los roles ayudan a asignar al personal correcto (mesero, chef, bartender...).

# roleNameLabel
source: Role name
es: Nombre del rol

# finishPreviousSteps
source: Finish previous steps first
es: Termina los pasos anteriores primero

# createRoleButton
source: Create role
es: Crear rol

source: Tariffs configured: {count}
es: Tarifas configuradas: {count}

# setRateDescription
source: Set a rate so staffing assignments know what to bill.
es: Establece una tarifa para que las asignaciones sepan cuánto cobrar.

# clientLabel
source: Client
es: Cliente

# roleLabel
source: Role
es: Rol

# adjustLaterHint
source: You can adjust this later in Catalog > Tariffs
es: Puedes ajustar esto después en Catálogo > Tarifas

# pleaseEnterTimesForAllStaff
source: Please enter sign-in and sign-out times for all selected staff
es: Por favor ingresa los horarios de entrada y salida para todo el personal seleccionado

# hoursSubmittedAndApproved
source: Hours submitted and approved successfully
es: Horas enviadas y aprobadas exitosamente

# submitHoursButton
source: Submit Hours ({count})
es: Enviar Horas ({count})

# notesLabel
source: Notes
es: Notas

# roleHint
source: Role
es: Rol

# noEventsNeedApprovalDescription
source: No events need hours approval at the moment.
es: No hay eventos que necesiten aprobación de horas en este momento.

# pendingReviewLabel
source: Pending Review
es: Revisión Pendiente

# needsSheetLabel
source: Needs Sheet
es: Necesita Hoja

# purchaseCancelledMessage
source: Purchase cancelled or failed. Please try again.
es: Compra cancelada o fallida. Por favor inténtalo de nuevo.

# upgradeToProTitle
source: Upgrade to Pro
es: Mejorar a Pro

# createAsManyEvents
source: Create as many events as you need
es: Crea tantos eventos como necesites

# noLimitsDescription
source: No limits on staff size
es: Sin límites en el tamaño del personal

# earlyAccessDescription
source: Early access to new capabilities
es: Acceso anticipado a nuevas funciones

# subscriptionTerms
source: By subscribing, you agree to our Terms of Service and Privacy Policy. Subscription automatically renews unless cancelled at least 24 hours before the end of the current period.
es: Al suscribirte, aceptas nuestros Términos de Servicio y Política de Privacidad. La suscripción se renueva automáticamente a menos que se cancele al menos 24 horas antes del final del período actual.

# staffWillAppearOnClockIn
source: Staff will appear here when they clock in
es: El personal aparecerá aquí cuando registren su entrada

source: Cancel invite
es: Cancelar invitación

# usedCount
source: Used: {used} / {max}
es: Usado: {used} / {max}

# usedCountUnlimited
source: Used: {used} (unlimited)
es: Usado: {used} (ilimitado)

# codePrefix
source: Code: {code}
es: Código: {code}

# addVenuesDescription
source: Add venues manually or discover them from Settings > Manage Cities
es: Agrega locales manualmente o descúbrelos desde Configuración > Gestionar Ciudades

# searchVenuesHint
source: Search venues...
es: Buscar locales...

# invalidPhoneFormat
source: Invalid phone number format
es: Formato de número de teléfono inválido

# tooManyAttemptsMessage
source: Too many attempts. Try later.
es: Demasiados intentos. Inténtalo más tarde.

# invalidCodeMessage
source: Invalid code. Check and try again.
es: Código inválido. Verifica e inténtalo de nuevo.

# codeExpiredMessage
source: Code expired. Request a new one.
es: Código expirado. Solicita uno nuevo.

# addPhoneDescription
source: Add a phone number as an alternative sign-in method
es: Agrega un número de teléfono como método alternativo de inicio de sesión

# phoneNumberHint
source: Phone number
es: Número de teléfono

source: Untitled
es: Sin título

source: Message
es: Mensaje

source: Event Information
es: Información del Evento

source: Venue Information
es: Información del Lugar

source: Staff Roles Required
es: Roles de Personal Requeridos

# successTitle
source: Success
es: Éxito

# selectTimeHint
source: Select time
es: Seleccionar hora

# clockingInStaff
source: Clocking in {staffName}...
es: Registrando entrada de {staffName}...

# roleVacancies
source: {roleName} ({accepted}/{total}, {vacancies} left)
es: {roleName} ({accepted}/{total}, {vacancies} restantes)

# phoneLinkedSuccessfully
source: Phone number linked successfully!
es: ¡Número de teléfono vinculado exitosamente!

# teamReady
source: Team ready: {name}
es: Equipo listo: {name}

# proWelcomeMessage
source: Welcome to FlowShift Pro! All business features unlocked.
es: ¡Bienvenido a FlowShift Pro! Todas las funciones empresariales desbloqueadas.

source: Date TBD
es: Fecha por definir

# freeTierLimitsDetails
source: • 25 team members max • 10 events per month • No analytics access
es: • Máximo 25 miembros del equipo • 10 eventos por mes • Sin acceso a analíticas

# moveToDraftsConfirmation
source: Move "{name}" back to drafts?
es: ¿Mover "{name}" a borradores?

# memberRemovedSuccess
source: Member removed
es: Miembro eliminado

source: Failed to remove member
es: Error al eliminar miembro

# staffHoursLabel
source: Staff Hours
es: Horas del Personal

# eventsCompletedLabel
source: Events Completed
es: Eventos Completados

# fulfillmentRateLabel
source: Fulfillment Rate
es: Tasa de Cumplimiento

# scanLabel
source: Scan
es: Escanear

# aiChatLabel
source: AI Chat
es: Chat IA

# uploadLabel
source: Upload
es: Subir
