Repository: juanse07/nexa
Catalog: lib/l10n/app_*.arb
Languages: es

# jobDataExtractor
source: Shift Data Extractor
es: Extractor de Datos de Turno

# uploadPdfToExtract
source: Upload a PDF or image to extract catering shift details
es: Sube un PDF o imagen para extraer detalles del turno de catering

# enterJobDetailsManually
source: Enter shift details manually for precise control
es: Ingresa los detalles del turno manualmente para un control preciso

# createJobsThroughAI
source: Create jobs through natural conversation with AI
es: Crea trabajos mediante conversación natural con IA

# jobDetails
source: Shift Details
es: Detalles del Turno

# jobInformation
source: Shift Information
es: Información del Turno

# jobTitle
source: Shift Title
es: Título del Turno

source: Client Name
es: Nombre del Cliente

source: Start Time
es: Hora de Inicio

source: End Time
es: Hora de Finalización

source: Headcount
es: Cantidad de Personas

source: Location Information
es: Información de Ubicación

source: Location Name
es: Nombre de Ubicación

source: Address
es: Dirección

source: City
es: Ciudad

source: State
es: Estado

source: Contact Name
es: Nombre de Contacto

source: Phone Number
es: Número de Teléfono

source: Email
es: Correo Electrónico

source: Notes
es: Notas

source: Shift
es: Turno

source: Client
es: Cliente

source: Date
es: Fecha

source: Time
es: Hora

source: Location
es: Ubicación

source: Phone
es: Teléfono

# jobsTabLabel
source: Jobs • {pendingCount} pending, {upcomingCount} upcoming, {pastCount} past
es: Trabajos • {pendingCount} pendientes, {upcomingCount} próximos, {pastCount} pasados

# pendingUpcomingStatus
source: {pendingCount} pending • {upcomingCount} upcoming • {baseTime}
es: {pendingCount} pendientes • {upcomingCount} próximos • {baseTime}

# upcomingPastStatus
source: {upcomingCount} upcoming • {pastCount} past • {baseTime}
es: {upcomingCount} próximos • {pastCount} pasados • {baseTime}

# pleaseSelectDate
source: Please select a date for the shift
es: Por favor selecciona una fecha para el turno

# jobSavedToPending
source: Shift saved to pending. Go to Jobs tab to review.
es: Turno guardado como pendiente. Ve a la pestaña Trabajos para revisar.

# jobDetailsCopied
source: Shift details copied to clipboard
es: Detalles del turno copiados al portapapeles

# jobPosted
source: Shift posted
es: Turno publicado

# sendJobInvitation
source: Send Shift Invitation
es: Enviar Invitación de Turno

# inviteToJob
source: Invite {name} to a shift
es: Invitar a {name} a un turno

# jobInvitationSent
source: Shift invitation sent!
es: ¡Invitación de turno enviada!

# jobNotFound
source: Shift not found
es: Turno no encontrado

# guests
source: {count} guests
es: {count} invitados

source: Roles Needed
es: Roles Necesarios

# untitledJob
source: Untitled Shift
es: Turno Sin Título

source: Expected Headcount
es: Cantidad de Personas Esperada

source: Contact Phone
es: Teléfono de Contacto

source: Contact Email
es: Correo Electrónico de Contacto

# errorJobIdMissing
source: Error: Shift ID is missing...
es: Error: Falta el ID del turno...

# postJob
source: Post Shift
es: Publicar Turno

# setRolesForJob
source: Set roles for this shift
es: Establecer roles para este turno

source: Search jobs...
es: Buscar trabajos...

source: Location TBD
es: Ubicación Por Determinar

# shareJobPrefix
source: Shift: {clientName}
es: Turno: {clientName}

# navCreate
source: Create
es: Crear

# navJobs
source: Jobs
es: Trabajos

# navHours
source: Hours
es: Horas

# navCatalog
source: Catalog
es: Catálogo

source: Upload Data
es: Subir Datos

source: Manual Entry
es: Entrada Manual

source: Multi-Upload
es: Subida Múltiple

source: AI Chat
es: Chat IA

source: Choose File
es: Elegir Archivo

source: Detailed Explanation
es: Explicación Detallada

source: Messages and team members
es: Mensajes y miembros del equipo

source: Search name or email
es: Buscar nombre o correo

source: All
es: Todos

source: Server
es: Mesero

# messages
source: Messages ({count})
es: Mensajes ({count})

# youveBeenInvitedTo
source: You've been invited to {jobName}
es: Has sido invitado a {jobName}

source: Hours Approval
es: Aprobación de Horas

source: Needs Sheet
es: Necesita Hoja

# needsSheetCount
source: {count} Needs Sheet
es: {count} Necesita Hoja

# staffCount
source: {count} staff
es: {count} personal

# catalogClientsRoles
source: Catalog • {clientCount} clients, {roleCount} roles
es: Catálogo • {clientCount} clientes, {roleCount} roles

source: Clients
es: Clientes

source: Tariffs
es: Tarifas

source: Add Client
es: Agregar Cliente

source: Teams
es: Equipos

# members
source: {count} members
es: {count} miembros

# pendingInvites
source: {count} pending invites
es: {count} invitaciones pendientes

source: View details
es: Ver detalles

source: New team
es: Nuevo equipo

source: My Profile
es: Mi Perfil

source: Settings
es: Configuración

source: Manage Teams
es: Gestionar Equipos

source: Logout
es: Cerrar Sesión

source: Select Files
es: Seleccionar Archivos

# multiSelectTip
source: Tip: Long-press to multi-select in the picker. Or use Add More to append.
es: Consejo: Mantén presionado para seleccionar múltiples archivos. O usa Agregar Más para añadir.

source: Contact Information
es: Información de Contacto

source: Additional Notes
es: Notas Adicionales

# saveJobDetails
source: Save Shift Details
es: Guardar Detalles del Turno

source: Save to Pending
es: Guardar como Pendiente

source: Pending
es: Pendiente

source: Upcoming
es: Próximo

source: Past
es: Pasado

# startConversation
source: Start a Conversation
es: Iniciar una Conversación

# aiWillGuideYou
source: The AI will guide you through creating a shift
es: La IA te guiará para crear un turno

source: Start New Conversation
es: Iniciar Nueva Conversación

# fecha
source: Date
es: Fecha

# hora
source: Time
es: Hora

# ubicacion
source: Location
es: Ubicación

# direccion
source: Address
es: Dirección

# jobFor
source: Shift for: {clientName}
es: Turno para: {clientName}

source: Accepted
es: Aceptado

source: Invitation
es: Invitación

source: View Jobs
es: Ver Trabajos

source: Add to Bartender
es: Agregar a Bartender

source: Add to Server
es: Agregar a Mesero

source: Add to {role}
es: Agregar a {role}

# typeMessage
source: Type a message...
es: Escribe un mensaje...

source: Save
es: Guardar

source: Delete
es: Eliminar

source: Retry
es: Reintentar

source: OK
es: Aceptar

source: Done
es: Listo

source: Close
es: Cerrar

source: Remove
es: Eliminar

source: Add
es: Agregar

source: Share
es: Compartir

source: Refresh
es: Actualizar

source: Create
es: Crear

source: Unknown
es: Desconocido

source: Select All
es: Seleccionar Todo

source: Deselect All
es: Deseleccionar Todo

source: Clear All
es: Limpiar Todo

source: Something went wrong
es: Algo salió mal

source: Coming soon
es: Próximamente

source: or
es: o

source: Cancel
es: Cancelar

source: Approve
es: Aprobar

source: Dismiss
es: Descartar

source: Apply
es: Aplicar

source: Skip
es: Saltar

source: Today
es: Hoy

source: Yesterday
es: Ayer

source: This Week
es: Esta Semana

source: Account
es: Cuenta

source: Role
es: Rol

source: Sign In
es: Iniciar Sesión

source: Sign in to continue
es: Inicia sesión para continuar

source: Sign out
es: Cerrar sesión

source: Password
es: Contraseña

source: Continue with Google
es: Continuar con Google

source: Continue with Apple
es: Continuar con Apple

source: Continue with Phone
es: Continuar con Teléfono

# appRoleManager
source: Manager
es: Gerente

# termsAndPrivacyDisclaimer
source: By continuing, you agree to our Terms of Service and Privacy Policy
es: Al continuar, aceptas nuestros Términos de Servicio y Política de Privacidad

source: Please enter email and password
es: Por favor, ingresa correo y contraseña

source: Google sign-in failed
es: Error al iniciar sesión con Google

source: Apple sign-in failed
es: Error al iniciar sesión con Apple

source: Email sign-in failed
es: Error al iniciar sesión con correo

source: Phone Sign In
es: Inicio de Sesión por Teléfono

# enterVerificationCode
source: Enter the verification code
es: Ingresa el código de verificación

# weWillSendVerificationCode
source: We'll send you a verification code
es: Te enviaremos un código de verificación

source: Send Verification Code
es: Enviar Código de Verificación

source: Verify Code
es: Verificar Código

source: Change
es: Cambiar

# pleaseEnterPhoneNumber
source: Please enter your phone number
es: Por favor, ingresa tu número de teléfono

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
es: Por favor, ingresa un número de teléfono válido

# pleaseEnterVerificationCode
source: Please enter the verification code
es: Por favor, ingresa el código de verificación

source: Verification code must be 6 digits
es: El código de verificación debe ser de 6 dígitos

# didntReceiveCodeResend
source: Didn't receive the code? Resend
es: ¿No recibiste el código? Reenviar

source: Welcome to FlowShift!
es: ¡Bienvenido a FlowShift!

# personalizeExperienceWithVenues
source: Let's personalize your experience by finding popular event venues in your area.
es: Personalicemos tu experiencia buscando lugares populares para eventos en tu área.

source: Get Started
es: Comenzar

source: Skip for now
es: Saltar por ahora

source: Where are you located?
es: ¿Dónde estás ubicado?

# addCitiesWhereYouOperate
source: Add one or more cities where you operate. You can discover venues for each city later.
es: Añade una o más ciudades donde operas. Puedes descubrir lugares para cada ciudad después.

source: Setting up your city...
es: Configurando tu ciudad...

# settingUpYourCities
source: Setting up your {cityCount} cities...
es: Configurando tus {cityCount} ciudades...

source: This will only take a moment...
es: Esto solo tomará un momento...

source: All Set!
es: ¡Todo listo!

# yourCityConfiguredSuccessfully
source: Your city has been configured successfully!
es: ¡Tu ciudad ha sido configurada exitosamente!

# yourCitiesConfiguredSuccessfully
source: Your {count} cities have been configured successfully!
es: ¡Tus {count} ciudades han sido configuradas exitosamente!

# discoverVenuesFromSettings
source: You can discover venues for each city from Settings > Manage Cities.
es: Puedes descubrir lugares para cada ciudad desde Configuración > Administrar Ciudades.

source: Start Using FlowShift
es: Comenzar a usar FlowShift

# couldNotDetectLocationEnterManually
source: Could not detect your location. Please enter your city manually.
es: No pudimos detectar tu ubicación. Por favor, ingresa tu ciudad manualmente.

# locationDetectionFailed
source: Location detection failed. Please enter your city manually.
es: La detección de ubicación falló. Por favor, ingresa tu ciudad manualmente.

source: Please add at least one city
es: Por favor, añade al menos una ciudad

# anErrorOccurredTryAgain
source: An error occurred. Please try again.
es: Ocurrió un error. Por favor, intenta de nuevo.

source: Let's get you set up
es: Vamos a prepararte

# stepsComplete
source: {completedCount} of {totalSteps} steps complete
es: {completedCount} de {totalSteps} pasos completados

# finishStepsToActivateWorkspace
source: Finish these steps to activate your FlowShift workspace:
es: Completa estos pasos para activar tu espacio de trabajo FlowShift:

# statusChipProfile
source: Profile
es: Perfil

# statusChipTeam
source: Team
es: Equipo

# statusChipClient
source: Client
es: Cliente

# statusChipRole
source: Role
es: Rol

# statusChipTariff
source: Tariff
es: Tarifa

# nextUp
source: Next up: {step}
es: Siguiente: {step}

# completeAllStepsForDashboard
source: Complete all steps above to access the full dashboard.
es: Completa todos los pasos anteriores para acceder al panel completo.

# addFirstLastNameForStaff
source: Add your first and last name so staff know who you are.
es: Añade tu nombre y apellido para que el personal sepa quién eres.

source: Review profile
es: Revisar perfil

source: Update profile
es: Actualizar perfil

# updateYourProfile
source: 1. Update your profile
es: 1. Actualiza tu perfil

source: Profile details updated.
es: Detalles del perfil actualizados.

# createYourTeamCompany
source: 2. Create your team/company
es: 2. Crea tu equipo/empresa

# setupStaffingCompanyExample
source: Set up your staffing company (e.g., "MES - Minneapolis Event Staffing")
es: Configura tu empresa de personal (por ejemplo, "MES - Minneapolis Event Staffing")

source: Team/Company name
es: Nombre del equipo/empresa

# exampleTeamName
source: e.g. MES - Minneapolis Event Staffing
es: ej. MES - Minneapolis Event Staffing

source: Description (optional)
es: Descripción (opcional)

# briefDescriptionStaffingCompany
source: Brief description of your staffing company
es: Breve descripción de tu empresa de personal

# completeProfileFirst
source: Complete your profile first
es: Completa tu perfil primero

source: Create team
es: Crear equipo

source: Add another team
es: Añadir otro equipo

# createYourFirstClient
source: 3. Create your first client
es: 3. Crea tu primer cliente

# needAtLeastOneClient
source: You need at least one client before you can staff events.
es: Necesitas al menos un cliente antes de poder asignar personal a eventos.

# exampleClientName
source: e.g. Bluebird Catering
es: ej. Bluebird Catering

source: Complete profile and team first
es: Completa tu perfil y equipo primero

source: Create client
es: Crear cliente

source: Add another client
es: Agregar otro cliente

# addAtLeastOneRole
source: 4. Add at least one role
es: 4. Añade al menos un rol

# rolesHelpMatchStaff
source: Roles help match staff to the right job (waiter, chef, bartender...).
es: Los roles ayudan a asignar personal al trabajo correcto (mesero, chef, bartender...).

source: Role name
es: Nombre del rol

# exampleRoleName
source: e.g. Lead Server
es: ej. Mesero Principal

source: Finish previous steps first
es: Completa los pasos anteriores primero

source: Create role
es: Crear rol

source: Add another role
es: Añadir otro rol

# setYourFirstTariff
source: 5. Set your first tariff
es: 5. Establece tu primera tarifa

# setRateForBilling
source: Set a rate so staffing assignments know what to bill.
es: Establece una tarifa para que las asignaciones de personal sepan qué cobrar.

# createClientFirst
source: Create a client first
es: Crea un cliente primero

# createRoleFirst
source: Create a role first
es: Crea un rol primero

source: Hourly rate (USD)
es: Tarifa por hora (USD)

# exampleHourlyRate
source: e.g. 24.00
es: ej. 24.00

# adjustTariffsInCatalog
source: You can adjust this later in Catalog > Tariffs
es: Puedes ajustar esto después en Catálogo > Tarifas

source: Save tariff
es: Guardar tarifa

source: Add another tariff
es: Añadir otra tarifa

# enterTeamNameToContinue
source: Enter a team/company name to continue
es: Ingresa un nombre de equipo/empresa para continuar

source: Team created successfully!
es: ¡Equipo creado exitosamente!

source: Failed to create team
es: Error al crear equipo

# enterClientNameToContinue
source: Enter a client name to continue
es: Ingresa un nombre de cliente para continuar

source: Client created
es: Cliente creado

source: Failed to create client
es: Error al crear cliente

# enterRoleNameToContinue
source: Enter a role name to continue
es: Ingresa un nombre de rol para continuar

source: Role created
es: Rol creado

source: Failed to create role
es: Error al crear rol

# createClientAndRoleBeforeTariff
source: Create a client and a role before adding a tariff
es: Crea un cliente y un rol antes de añadir una tarifa

# selectClientAndRole
source: Select a client and a role
es: Selecciona un cliente y un rol

# enterValidHourlyRate
source: Enter a valid hourly rate (e.g. 22.50)
es: Ingresa una tarifa por hora válida (ej. 22.50)

source: Tariff saved
es: Tarifa guardada

source: Failed to save tariff
es: Error al guardar tarifa

source: Failed to open profile
es: Error al abrir perfil

# navAttendance
source: Attendance
es: Asistencia

# navStats
source: Stats
es: Estadísticas

source: Welcome back!
es: ¡Bienvenido de nuevo!

source: Manage your events
es: Administra tus eventos

# featureChatDesc
source: send jobs through the chat
es: enviar trabajos a través del chat

# featureAIChatDesc
source: create, update, ask questions
es: crear, actualizar, hacer preguntas

# featureJobsDesc
source: Manage your created cards
es: Administra tus tarjetas creadas

# featureTeamsDesc
source: invite people to Join
es: invita personas a unirse

# featureHoursDesc
source: Track team work hours
es: Rastrear horas de trabajo del equipo

# featureCatalogDesc
source: create clients, roles, and tariffs
es: crear clientes, roles y tarifas

# quickActionUpload
source: Upload
es: Subir

# quickActionTimesheet
source: Timesheet
es: Hoja de Tiempo

source: Team Members
es: Miembros del Equipo

source: Hours
es: Horas

source: Recent Activity
es: Actividad Reciente

# confirmLogoutMessage
source: Are you sure you want to logout?
es: ¿Estás seguro de que quieres cerrar sesión?

# attendanceTitle
source: Attendance
es: Asistencia

source: Force Clock-Out
es: Forzar Salida

# confirmClockOutMessage
source: Are you sure you want to clock out {staffName}?
es: ¿Estás seguro de que quieres marcar salida de {staffName}?

source: Clock Out
es: Marcar Salida

# staffClockedOutSuccessfully
source: {staffName} clocked out successfully
es: {staffName} marcó salida exitosamente

source: Failed to clock out staff
es: Error al marcar salida del personal

# viewingHistoryFor
source: Viewing history for {staffName}
es: Viendo historial de {staffName}

# viewingDetailsFor
source: Viewing details for {staffName}
es: Viendo detalles de {staffName}

source: No attendance records
es: Sin registros de asistencia

# tryAdjustingFilters
source: Try adjusting your filters
es: Intenta ajustar tus filtros

# recordsAppearWhenStaffClockIn
source: Records will appear here when staff clock in
es: Los registros aparecerán aquí cuando el personal marque entrada

source: Clear Filters
es: Limpiar Filtros

source: Analyzing...
es: Analizando...

source: AI Analysis
es: Análisis con IA

source: Failed to load data
es: Error al cargar datos

source: Bulk Clock-In
es: Entrada Masiva

# pleaseSelectAtLeastOneStaff
source: Please select at least one staff member
es: Por favor selecciona al menos un miembro del personal

# successfullyClockedIn
source: Successfully clocked in {successful} of {total} staff
es: Entrada exitosa de {successful} de {total} personal

# failedBulkClockIn
source: Failed to perform bulk clock-in
es: Error al realizar la entrada masiva

# noAcceptedStaffForEvent
source: No accepted staff for this event
es: Sin personal aceptado para este evento

source: Override Note (optional)
es: Nota de anulación (opcional)

# groupCheckInHint
source: e.g., Group check-in at entrance
es: ej., Entrada grupal en la entrada

# clockInStaffCount
source: Clock In {count} Staff
es: Marcar Entrada de {count} Personal

source: Bulk Clock-In Results
es: Resultados de Entrada Masiva

source: Already clocked in
es: Ya marcó entrada

source: Flagged Attendance
es: Asistencia Marcada

source: Approved
es: Aprobado

source: Dismissed
es: Descartado

source: No pending flags!
es: ¡Sin banderas pendientes!

source: No flagged entries found
es: Sin entradas marcadas encontradas

# allEntriesLookNormal
source: All attendance entries look normal
es: Todas las entradas de asistencia se ven normales

source: Review Flag
es: Revisar Bandera

source: Review Notes (optional)
es: Notas de Revisión (opcional)

# addNotesAboutReview
source: Add any notes about this review...
es: Añade cualquier nota sobre esta revisión...

source: Unknown Staff
es: Personal Desconocido

source: Unknown Event
es: Evento Desconocido

# clockInTime
source: Clock-In
es: Entrada

# clockOutTime
source: Clock-Out
es: Salida

# durationLabel
source: Duration
es: Duración

# expectedDuration
source: Expected
es: Esperado

source: Unusual Hours
es: Horas Inusuales

source: Excessive Duration
es: Duración Excesiva

source: Late Clock-Out
es: Salida Tardía

source: Location Mismatch
es: Discrepancia de Ubicación

source: Filter Attendance
es: Filtrar Asistencia

source: Date Range
es: Rango de Fechas

source: Last 7 Days
es: Últimos 7 Días

source: Custom
es: Personalizado

source: Event
es: Evento

source: All Events
es: Todos los Eventos

source: Status
es: Estado

source: Apply Filters
es: Aplicar Filtros

source: Working
es: Trabajando

source: Flags
es: Banderas

source: Currently Working
es: Actualmente Trabajando

source: No staff working
es: Sin personal trabajando

# staffAppearsWhenClockIn
source: Staff will appear here when they clock in
es: El personal aparecerá aquí cuando marquen entrada

source: History
es: Historial

source: On-site
es: En el sitio

# autoClockOut
source: Auto clocked-out
es: Salida automática

source: Completed
es: Completado

source: Flagged
es: Marcado

source: No-show
es: No se presentó

source: Not specified
es: No especificado

source: Clock In
es: Marcar Entrada

source: Verified on-site
es: Verificado en el sitio

source: Weekly Hours
es: Horas Semanales

# noDataForPeriod
source: No data for this period
es: Sin datos para este período

source: Failed to load flagged attendance
es: Error al cargar asistencia marcada

source: Failed to update flag
es: Error al actualizar la bandera

source: Stats
es: Estadísticas

source: Failed to load statistics
es: Error al cargar estadísticas

source: Week
es: Semana

source: Month
es: Mes

source: Year
es: Año

source: All Time
es: Todo el Tiempo

source: Download report
es: Descargar reporte

source: Download PDF
es: Descargar PDF

source: Download Word
es: Descargar Word

source: Analyzing your data...
es: Analizando tus datos...

source: Failed to generate
es: Error al generar

source: Payroll Summary
es: Resumen de Nómina

# staffMembersCount
source: {count} staff members
es: {count} miembros del personal

source: View All
es: Ver Todo

source: Total Hours
es: Horas Totales

source: Total Payroll
es: Nómina Total

# averagePerStaff
source: Avg/Staff
es: Promedio/Personal

source: Top Earners
es: Mayores Ingresos

# noPayrollDataForPeriod
source: No payroll data for this period
es: Sin datos de nómina para este período

# shiftsAndHours
source: {shifts} shifts • {hours}h
es: {shifts} turnos • {hours}h

source: Top Performers
es: Mejores Desempeños

source: Based on shifts completed
es: Basado en turnos completados

source: Approve Hours
es: Aprobar Horas

source: Upload Sign-In Sheet
es: Subir Hoja de Asistencia

# takePhotoOrUploadSheet
source: Take a photo or upload the client's sign-in/out sheet
es: Toma una foto o sube la hoja de entrada/salida del cliente

source: Camera
es: Cámara

source: Gallery
es: Galería

source: Analyze with AI
es: Analizar con IA

source: Analyzing sign-in sheet with AI...
es: Analizando hoja de asistencia con IA...

source: Extracted Staff Hours
es: Horas de Personal Extraídas

source: Review and edit before submitting
es: Revisa y edita antes de enviar

# signInLabel
source: Sign In
es: Entrada

# signOutLabel
source: Sign Out
es: Salida

# notAvailable
source: N/A
es: N/D

# hoursCount
source: {hours} hours
es: {hours} horas

source: Bulk Approve
es: Aprobar en Lote

# approveHoursForAllStaff
source: Approve hours for all {count} staff members?
es: ¿Aprobar horas para los {count} miembros del personal?

source: Approve All
es: Aprobar Todo

source: Name Matching Results
es: Resultados de Coincidencia de Nombres

# staffMembersMatched
source: {processed}/{total} staff members matched
es: {processed}/{total} miembros del personal coinciden

# editHoursFor
source: Edit Hours - {name}
es: Editar Horas - {name}

source: Sign In Time
es: Hora de Entrada

source: Sign Out Time
es: Hora de Salida

source: Approved Hours
es: Horas Aprobadas

source: Optional notes
es: Notas opcionales
