Repository: juanse07/nexa
Catalog: lib/l10n/app_*.arb
Languages: es

# noHoursMatched
source: No hours were matched. Please check the names on the sheet.
es: No se encontraron coincidencias de horas. Verifica los nombres en la hoja.

# noHoursApproved
source: No hours were approved. Check match results above.
es: No se aprobaron horas. Revisa los resultados de coincidencia arriba.

source: Failed to bulk approve
es: Error al aprobar en lote

source: Analysis failed
es: Error en el análisis

source: Failed to pick image
es: Error al seleccionar imagen

source: Failed to load events
es: Error al cargar eventos

source: Unknown error
es: Error desconocido

source: All Caught Up!
es: ¡Todo al Día!

# noEventsNeedApproval
source: No events need hours approval at the moment.
es: No hay eventos que necesiten aprobación de horas en este momento.

# pendingReviewCount
source: {count} Pending Review
es: {count} Pendientes de Revisión

source: Pending Review
es: Pendiente de Revisión

source: Date unknown
es: Fecha desconocida

source: Manual Hours Entry
es: Entrada Manual de Horas

# selectedCount
source: {count} selected
es: {count} seleccionados

# searchStaffByNameEmail
source: Search staff by name or email
es: Buscar personal por nombre o correo

source: Failed to load users
es: Error al cargar usuarios

source: Failed to search users
es: Error al buscar usuarios

source: No users found
es: Sin usuarios encontrados

source: Submit Hours ({count})
es: Enviar Horas ({count})

# hoursForStaff
source: Hours for {name}
es: Horas para {name}

# signInTimeRequired
source: Sign-In Time *
es: Hora de Entrada *

source: Not set
es: No configurado

# signOutTimeRequired
source: Sign-Out Time *
es: Hora de Salida *

# totalHoursFormat
source: Total: {hours} hours
es: Total: {hours} horas

# hoursSubmittedApprovedSuccess
source: Hours submitted and approved successfully
es: Horas enviadas y aprobadas exitosamente

source: Failed to submit hours
es: Error al enviar horas

# pleaseEnterSignInSignOut
source: Please enter sign-in and sign-out times for all selected staff
es: Por favor, ingresa hora de entrada y salida para todo el personal seleccionado

# createTeamTitle
source: Create Team
es: Crear Equipo

# teamNameLabel
source: Team name
es: Nombre del equipo

# enterTeamNameError
source: Enter a team name
es: Ingresa un nombre de equipo

# deleteTeamConfirmation
source: Delete team?
es: ¿Eliminar equipo?

# deleteTeamWarning
source: Deleting this team will remove it permanently. Events that reference it will block deletion.
es: Eliminar este equipo lo eliminará permanentemente. Los eventos que lo referencien bloquearán la eliminación.

source: Team deleted
es: Equipo eliminado

source: Failed to delete team
es: Error al eliminar equipo

# noTeamsYet
source: No teams yet. Tap "New team" to create one.
es: Sin equipos aún. Toca "Nuevo equipo" para crear uno.

source: Untitled team
es: Equipo sin título

source: Co-Manager
es: Co-Gerente

source: Invite by email
es: Invitar por correo

source: Message (optional)
es: Mensaje (opcional)

source: Send invite
es: Enviar invitación

source: Failed to send invite
es: Error al enviar invitación

# inviteSentTo
source: Invite sent to {email}
es: Invitación enviada a {email}

source: Revoke Invite Link
es: Revocar Enlace de Invitación

# revokeInviteLinkConfirmation
source: This will prevent anyone from using this link to join. Continue?
es: Esto impedirá que alguien use este enlace para unirse. ¿Continuar?

source: Revoke
es: Revocar

source: Invite link revoked
es: Enlace de invitación revocado

source: Usage Log
es: Registro de Uso

# noUsageRecorded
source: No usage recorded yet.
es: Sin uso registrado aún.

source: Error loading usage
es: Error al cargar uso

source: Public Link Created!
es: ¡Enlace Público Creado!

# publicLinkDescription
source: Share this link on social media to recruit new team members. All applicants will require your approval.
es: Comparte este enlace en redes sociales para reclutar nuevos miembros del equipo. Todos los solicitantes requerirán tu aprobación.

source: Link copied!
es: ¡Enlace copiado!

# codeLabel
source: Code:
es: Código:

source: Code copied!
es: ¡Código copiado!

# shareJoinTeam
source: Join our team on FlowShift
es: Únete a nuestro equipo en FlowShift

source: Add Co-Manager
es: Agregar Co-Gerente

# addCoManagerInstructions
source: Enter the email of a manager to add them as a co-manager. They must already have a FlowShift Manager account.
es: Ingresa el correo de un gerente para agregarlo como co-gerente. Deben tener ya una cuenta de FlowShift Manager.

# managerEmailLabel
source: Manager email
es: Correo del gerente

# enterEmailError
source: Enter an email
es: Ingresa un correo

# enterValidEmailError
source: Enter a valid email
es: Ingresa un correo válido

source: Co-manager added
es: Co-gerente agregado

source: Remove co-manager
es: Eliminar co-gerente

# removeCoManagerConfirmation
source: Remove {name} as co-manager?
es: ¿Eliminar a {name} como co-gerente?

source: Co-manager removed
es: Co-gerente eliminado

# userMissingProviderError
source: User is missing provider/subject information
es: El usuario no tiene información de proveedor/sujeto

source: Add team member
es: Agregar miembro del equipo

source: Search by name or email
es: Buscar por nombre o correo

# noUsersFoundTryAnother
source: No users found. Try another search.
es: Sin usuarios encontrados. Intenta otra búsqueda.

# memberChip
source: Member
es: Miembro

# addedToTeam
source: Added {name} to the team
es: {name} agregado al equipo

source: Failed to add member
es: Error al agregar miembro

source: Invite cancelled
es: Invitación cancelada

source: Failed to cancel invite
es: Error al cancelar invitación

# failedToLoadTeamData
source: Could not load team data
es: No se pudieron cargar los datos del equipo

# membersSection
source: Members
es: Miembros

source: No active members yet.
es: Sin miembros activos aún.

source: Pending member
es: Miembro pendiente

# coManagersSection
source: Co-Managers
es: Co-Gerentes

source: No co-managers yet.
es: Aún no hay co-gerentes.

# removeCoManagerTooltip
source: Remove co-manager
es: Eliminar co-gerente

# invitesSection
source: Invites
es: Invitaciones

# inviteLinkButton
source: Invite Link
es: Enlace de Invitación

# publicLinkButton
source: Public Link
es: Enlace Público

# emailInviteButton
source: Email
es: Correo

source: No invites yet.
es: Aún no hay invitaciones.

source: Pending Applicants
es: Solicitantes Pendientes

source: Active Invite Links
es: Enlaces de Invitación Activos

# publicBadge
source: PUBLIC
es: PÚBLICO

# usedLabel
source: Used:
es: Usado:

# unlimitedUses
source: (unlimited)
es: (ilimitado)

# joinsLabel
source: joins
es: uniones

source: Deny Applicant
es: Rechazar Solicitante

# denyApplicantConfirmation
source: Are you sure you want to deny this applicant?
es: ¿Estás seguro de que quieres rechazar a este solicitante?

source: Deny
es: Rechazar

source: Applicant approved!
es: ¡Solicitante aprobado!

source: Applicant denied
es: Solicitante rechazado

source: Search conversations...
es: Buscar conversaciones...

source: Failed to load conversations
es: Error al cargar conversaciones

source: No conversations yet
es: Sin conversaciones aún

# startChattingWithTeam
source: Start chatting with your team to see your messages here
es: Comienza a chatear con tu equipo para ver tus mensajes aquí

# managerBadge
source: Manager
es: Gerente

source: No messages yet
es: Sin mensajes aún

# addMembersToStartChatting
source: Add members to your team to start chatting
es: Agrega miembros a tu equipo para comenzar a chatear

source: New Chat
es: Nuevo Chat

source: Search contacts...
es: Buscar contactos...

source: Failed to load contacts
es: Error al cargar contactos

# noContactsMatch
source: No contacts match your search
es: Ningún contacto coincide con tu búsqueda

source: No team members yet
es: Sin miembros del equipo aún

source: Active
es: Activo

source: Valerio Assistant
es: Asistente Valerio

# valerioAssistantDesc
source: Create events, manage jobs, and get instant help
es: Crea eventos, gestiona trabajos y obtén ayuda instantánea

source: typing...
es: escribiendo...

source: Failed to send message
es: Error al enviar mensaje

# sendMessageToStartConversation
source: Send a message to start the conversation
es: Envía un mensaje para comenzar la conversación

source: Failed to load messages
es: Error al cargar mensajes

# staffAcceptedInvitation
source: {name} accepted the invitation!
es: ¡{name} aceptó la invitación!

# staffDeclinedInvitation
source: {name} declined the invitation
es: {name} rechazó la invitación

source: Failed to send invitation
es: Error al enviar invitación

source: No upcoming jobs
es: Sin trabajos próximos

# noJobsMatch
source: No jobs match your search
es: Ningún trabajo coincide con tu búsqueda

source: Unknown Client
es: Cliente Desconocido

source: No venue specified
es: Sin lugar especificado

source: No date specified
es: Sin fecha especificada

# selectRoleForStaffMember
source: Select a role for the staff member:
es: Selecciona un rol para el miembro del personal:

# noRolesAvailable
source: No roles available for this job
es: Sin roles disponibles para este trabajo

source: Sending...
es: Enviando...

source: Send Invitation
es: Enviar Invitación

source: Accept
es: Aceptar

source: Decline
es: Rechazar

source: Waiting for response...
es: Esperando respuesta...

# callTime
source: Call time: {time}
es: Hora de llegada: {time}

source: Accepted Staff ({count})
es: Personal Aceptado ({count})

source: Working Hours Sheet
es: Hoja de Horas de Trabajo

source: Hours Sheet (PDF)
es: Hoja de Horas (PDF)

source: Hours Sheet (Word)
es: Hoja de Horas (Word)

source: Member
es: Miembro

source: Remove Staff Member
es: Eliminar Miembro del Personal

# confirmRemoveStaff
source: Are you sure you want to remove this staff member from the event?
es: ¿Estás seguro de que deseas eliminar a este miembro del personal del evento?

# staffRemovedSuccess
source: Staff member removed successfully
es: Miembro del personal eliminado exitosamente

# failedToRemoveStaff
source: Failed to remove staff member
es: Error al eliminar miembro del personal

# confirmClockIn
source: Clock in {staffName} for this event?
es: ¿Marcar entrada de {staffName} para este evento?

# alreadyClockedInName
source: {staffName} is already clocked in
es: {staffName} ya marcó entrada

# clockedInSuccess
source: {staffName} clocked in successfully
es: {staffName} marcó entrada exitosamente

# clockInFailed
source: Clock-in failed. Please try again.
es: Error al marcar entrada. Intenta de nuevo.

source: Publish
es: Publicar

source: Edit Details
es: Editar Detalles

source: Keep Open After Event
es: Mantener Abierto Después del Evento

# preventAutoCompletion
source: Prevent automatic completion when event date passes
es: Prevenir finalización automática cuando pase la fecha del evento

source: Move to Drafts
es: Mover a Borradores

source: Clock In Staff
es: Marcar Entrada del Personal

source: Open to All Staff
es: Abierto para Todo el Personal

# moveToDraftsWithStaff
source: This will: • Remove all {count} accepted staff members • Send them a notification • Hide the job from staff view You can republish it later.
es: Esto hará: • Eliminar a los {count} miembros del personal aceptados • Enviarles una notificación • Ocultar el trabajo de la vista del personal Puedes republicarlo después.

# moveToDraftsNoStaff
source: This will hide the job from staff view. You can republish it later.
es: Esto ocultará el trabajo de la vista del personal. Puedes republicarlo después.

# eventMovedToDrafts
source: {name} moved to drafts!
es: ¡{name} movido a borradores!

source: Failed to move to drafts
es: Error al mover a borradores

# eventStaysOpen
source: Event will stay open after completion
es: El evento permanecerá abierto después de la finalización

# eventAutoCompletes
source: Event will auto-complete when past
es: El evento se completará automáticamente cuando haya pasado

source: Failed to update
es: Error al actualizar

source: Failed to generate sheet
es: Error al generar hoja

# confirmOpenToAll
source: Make "{name}" visible to all staff members? This will change the job from private (invited only) to public, allowing all team members to see and accept it.
es: ¿Hacer que "{name}" sea visible para todos los miembros del personal? Esto cambiará el trabajo de privado (solo invitado) a público, permitiendo que todos los miembros del equipo lo vean y acepten.

source: Open to All
es: Abrir a Todos

# eventNowOpenToAll
source: {name} is now open to all staff!
es: ¡{name} ahora está abierto para todo el personal!

source: Failed to make public
es: Error al hacer público

# vacanciesLeft
source: left
es: disponibles

source: Manage your preferences
es: Administra tus preferencias

source: Work Terminology
es: Terminología del Trabajo

# howPreferWorkAssignments
source: How do you prefer to call your work assignments?
es: ¿Cómo prefieres llamar a tus asignaciones de trabajo?

source: Jobs
es: Empleos

# jobsExample
source: e.g., "My Jobs", "Create Job"
es: ej., "Mis Empleos", "Crear Empleo"

source: Shifts
es: Turnos

# shiftsExample
source: e.g., "My Shifts", "Create Shift"
es: ej., "Mis Turnos", "Crear Turno"

source: Events
es: Eventos

# eventsExample
source: e.g., "My Events", "Create Event"
es: ej., "Mis Eventos", "Crear Evento"

source: Save Terminology
es: Guardar Terminología

# terminologyUpdateInfo
source: This will update how work assignments appear throughout the app
es: Esto actualizará cómo aparecen las asignaciones de trabajo en toda la aplicación

# venuesUpdatedSuccess
source: Venues updated successfully!
es: ¡Lugares actualizados exitosamente!

# terminologyUpdatedSuccess
source: Terminology updated successfully!
es: ¡Terminología actualizada exitosamente!

source: Location & Venues
es: Ubicación y Lugares

source: Cities
es: Ciudades

source: cities configured
es: ciudades configuradas

source: Venues
es: Lugares

source: discovered
es: descubiertos

source: Last Updated
es: Última Actualización

# noCitiesConfiguredDescription
source: No cities configured yet. Add cities to discover venues and help the AI suggest accurate event locations in your area.
es: No hay ciudades configuradas aún. Agrega ciudades para descubrir lugares y ayudar a la IA a sugerir ubicaciones precisas de eventos en tu área.

source: Manage Cities
es: Administrar Ciudades

source: Add Cities
es: Agregar Ciudades

# viewAllVenues
source: View All {count} Venues
es: Ver los {count} Lugares

source: Add New Venue
es: Agregar Nuevo Lugar

# venueAddedSuccess
source: Venue added successfully!
es: ¡Lugar agregado exitosamente!

# daysAgo
source: {days} days ago
es: hace {days} días

# failedToLoadProfile
source: Failed to load profile. Please try again in a few minutes.
es: Error al cargar el perfil. Por favor, intenta de nuevo en unos minutos.

source: Failed to upload image
es: Error al cargar la imagen

source: New look saved!
es: ¡Nuevo aspecto guardado!

source: Failed to save
es: Error al guardar

source: Profile picture updated!
es: ¡Foto de perfil actualizada!

# deleteCreationConfirm
source: Delete creation?
es: ¿Eliminar creación?

# deleteCreationMessage
source: This will remove it from your gallery.
es: Esto la eliminará de tu galería.

source: Creation deleted
es: Creación eliminada

source: Failed to delete
es: Error al eliminar

# revertedToOriginal
source: Reverted to original photo
es: Se restauró a la foto original

source: Failed to revert
es: Error al restaurar

source: Profile updated
es: Perfil actualizado

source: First name
es: Nombre

source: Last name
es: Apellido

# appIdOptional
source: App ID (9 digits, optional)
es: ID de aplicación (9 dígitos, opcional)

source: Linked Accounts
es: Cuentas Vinculadas

source: Primary
es: Primaria

# linkAccount
source: Link
es: Vincular

# phoneNumberLinkedSuccess
source: Phone number linked successfully!
es: ¡Número de teléfono vinculado exitosamente!

source: Upload
es: Subir

source: Glow Up
es: Transformar

source: Original Photo
es: Foto Original

source: My Creations
es: Mis Creaciones

source: View Full Size
es: Ver Tamaño Completo

source: Use This Photo
es: Usar Esta Foto

source: Link Phone Number
es: Vincular Número de Teléfono

# addPhoneSigninMethod
source: Add a phone number as an alternative sign-in method
es: Agrega un número de teléfono como método de inicio de sesión alternativo

# sixDigitCode
source: 6-digit code
es: Código de 6 dígitos

# verifyAndLink
source: Verify & Link
es: Verificar y Vincular

source: Verification failed
es: Verificación fallida

source: Invalid phone number format
es: Formato de número de teléfono inválido

# tooManyAttempts
source: Too many attempts. Try later.
es: Demasiados intentos. Intenta más tarde.

# enterSixDigitCode
source: Please enter the 6-digit code
es: Por favor, ingresa el código de 6 dígitos

source: No verification in progress
es: No hay verificación en progreso

# invalidCode
source: Invalid code. Check and try again.
es: Código inválido. Verifica e intenta de nuevo.

# codeExpired
source: Code expired. Request a new one.
es: El código expiró. Solicita uno nuevo.

# firebaseAuthFailed
source: Firebase authentication failed
es: La autenticación de Firebase falló

source: Failed to get auth token
es: Error al obtener el token de autenticación

source: Failed to link phone number
es: Error al vincular el número de teléfono

source: Failed to link
es: Error al vincular

source: Failed to send code
es: Error al enviar código

# welcomeFlowShiftPro
source: Welcome to FlowShift Pro! All business features unlocked.
es: ¡Bienvenido a FlowShift Pro! Todas las funciones comerciales desbloqueadas.

# purchaseCancelledFailed
source: Purchase cancelled or failed. Please try again.
es: La compra fue cancelada o falló. Por favor, intenta de nuevo.

# subscriptionRestoredSuccess
source: Subscription restored successfully!
es: ¡Suscripción restaurada exitosamente!

# noActiveSubscription
source: No active subscription found to restore.
es: No se encontró ninguna suscripción activa para restaurar.

source: Restore error
es: Error de restauración

source: Upgrade to Pro
es: Actualizar a Pro

source: Scale Your Business
es: Escala tu Negocio

source: Unlimited team members
es: Miembros del equipo ilimitados

# noLimitsStaffSize
source: No limits on staff size
es: Sin límites en el tamaño del personal

source: Unlimited events
es: Eventos ilimitados

# createManyEvents
source: Create as many events as you need
es: Crea tantos eventos como necesites

source: Advanced analytics
es: Análisis avanzados

# insightsReports
source: Insights & reports for your business
es: Información y reportes para tu negocio

source: Priority support
es: Soporte prioritario

# getHelpWhenNeeded
source: Get help when you need it
es: Obtén ayuda cuando la necesites

source: All future Pro features
es: Todas las futuras funciones Pro

# earlyAccessCapabilities
source: Early access to new capabilities
es: Acceso anticipado a nuevas capacidades

source: per month
es: por mes

source: Cancel anytime • No commitments
es: Cancela en cualquier momento • Sin compromisos

source: Restore Purchase
es: Restaurar Compra

source: Free Tier Limits
es: Límites del Nivel Gratuito

# freeTierLimitsList
source: • 25 team members max • 10 events per month • No analytics access
es: • Máximo 25 miembros del equipo • 10 eventos por mes • Sin acceso a análisis

# subscriptionTermsDisclaimer
source: By subscribing, you agree to our Terms of Service and Privacy Policy. Subscription automatically renews unless cancelled at least 24 hours before the end of the current period.
es: Al suscribirte, aceptas nuestros Términos de Servicio y Política de Privacidad. La suscripción se renueva automáticamente a menos que se cancele al menos 24 horas antes del final del período actual.

source: Not authenticated
es: No autenticado

source: Failed to load venues
es: Error al cargar lugares

source: Venue added successfully!
es: ¡Lugar agregado exitosamente!

source: Venue updated successfully!
es: ¡Lugar actualizado exitosamente!

source: Venue removed successfully!
es: ¡Lugar eliminado exitosamente!

source: Failed to delete venue
es: Error al eliminar lugar

# removeVenueConfirmation
source: Remove Venue?
es: ¿Eliminar Lugar?

# confirmRemoveVenue
source: Are you sure you want to remove "{name}"?
es: ¿Estás seguro de que deseas eliminar "{name}"?

source: My Venues
es: Mis Lugares

source: Add Venue
es: Agregar Lugar

source: No venues yet
es: Sin lugares aún

# addFirstVenueOrDiscover
source: Add your first venue or run venue discovery
es: Agrega tu primer lugar o ejecuta el descubrimiento de lugares

source: Add First Venue
es: Agregar Primer Lugar

source: Your Area
es: Tu Área

# aiSource
source: AI
es: IA

source: Search venues...
es: Buscar lugares...

# noVenuesInCity
source: No venues in {cityName} yet
es: Sin lugares en {cityName} aún

# addVenuesManuallyOrDiscover
source: Add venues manually or discover them from Settings > Manage Cities
es: Agrega lugares manualmente o descúbrelos en Configuración > Administrar Ciudades

# addCitiesFromSettings
source: Add cities from Settings > Manage Cities
es: Agrega ciudades desde Configuración > Administrar Ciudades

# noVenuesMatch
source: No venues match your search
es: Ningún lugar coincide con tu búsqueda

# tryDifferentFilterOrTerm
source: Try a different filter or search term
es: Intenta con un filtro o término de búsqueda diferente

# tryDifferentSearchTerm
source: Try a different search term
es: Intenta con un término de búsqueda diferente

source: Failed to get place details
es: Error al obtener detalles del lugar

source: Edit Venue
es: Editar Lugar

source: Edit venue details below
es: Edita los detalles del lugar a continuación

# searchVenueAutoFill
source: Search for a venue and we'll auto-fill the details
es: Busca un lugar y rellenaremos los detalles automáticamente

source: Search venue
es: Buscar lugar

# venueSearchExample
source: e.g., Ball Arena Denver
es: ej., Ball Arena Denver

source: Enter manually instead
es: Escribir manualmente

# venueFoundGooglePlaces
source: Venue found via Google Places
es: Lugar encontrado a través de Google Places

source: Clear
es: Limpiar

source: Venue Name *
es: Nombre del Lugar *

# venueNameExample
source: e.g., Ball Arena
es: ej., Ball Arena

# pleaseEnterVenueName
source: Please enter a venue name
es: Ingresa el nombre del lugar

# addressRequired
source: Address *
es: Dirección *

# addressExample
source: e.g., 1000 Chopper Cir, Denver, CO 80204
es: ej., 1000 Chopper Cir, Denver, CO 80204

# pleaseEnterAddress
source: Please enter an address
es: Ingresa una dirección

source: Required
es: Requerido

# venueAddedCityTabCreated
source: Venue added and new city tab created!
es: ¡Lugar agregado y nueva pestaña de ciudad creada!

# venueUpdatedCityTabAdded
source: Venue updated and city tab added!
es: ¡Lugar actualizado y pestaña de ciudad agregada!

source: Failed to save venue
es: Error al guardar lugar

source: Saving...
es: Guardando...

source: Save Changes
es: Guardar Cambios

source: Failed to load cities
es: Error al cargar ciudades

# cityAlreadyInList
source: This city is already in your list
es: Esta ciudad ya está en tu lista

source: Added {city}
es: {city} agregada

source: Failed to add city
es: Error al agregar ciudad

source: Failed to update city
es: Error al actualizar ciudad

source: Delete City
es: Eliminar Ciudad

# confirmDeleteCity
source: Delete {cityName}? This will also remove all venues associated with this city.
es: ¿Eliminar {cityName}? Esto también eliminará todos los lugares asociados con esta ciudad.

# deletedCity
source: Deleted {cityName}
es: {cityName} eliminada

source: Failed to delete city
es: Error al eliminar ciudad

source: Discover Venues
es: Descubrir Lugares
